src/test/resources/data/COPC_IN000001UK01Sanitized

{"ebXML": "<soap:Envelope xmlns:eb=\"http://www.oasis-open.org/committees/ebxml-msg/schema/msg-header-2_0.xsd\" xmlns:hl7ebxml=\"urn:hl7-org:transport/ebxml/DSTUv1.0\" xmlns:soap=\"http://schemas.xmlsoap.org/soap/envelope/\"><soap:Header><eb:MessageHeader eb:version=\"2.0\" soap:mustUnderstand=\"1\"><eb:From><eb:PartyId eb:type=\"urn:nhs:names:partyType:ocs+serviceInstance\">A91720-9198820</eb:PartyId></eb:From><eb:To><eb:PartyId eb:type=\"urn:nhs:names:partyType:ocs+serviceInstance\">A91368-9199177</eb:PartyId></eb:To><eb:CPAId>324b089db02cf431bbcd</eb:CPAId><eb:ConversationId>ff1457fb-4f58-4870-8d90-24d9c3ef8b91</eb:ConversationId><eb:Service>urn:nhs:names:services:gp2gp</eb:Service><eb:Action>COPC_IN000001UK01</eb:Action><eb:MessageData><eb:MessageId>6DB0BD79-3760-47BC-9D15-0D34D61FD90B</eb:MessageId><eb:Timestamp>2021-04-08T09:28:34.787Z</eb:Timestamp><eb:TimeToLive>2021-04-08T15:43:34.787Z</eb:TimeToLive></eb:MessageData><eb:DuplicateElimination /></eb:MessageHeader><eb:AckRequested eb:version=\"2.0\" soap:mustUnderstand=\"1\" soap:actor=\"urn:oasis:names:tc:ebxml-msg:actor:nextMSH\" eb:signed=\"false\" /></soap:Header><soap:Body><eb:Manifest eb:version=\"2.0\" soap:mustUnderstand=\"1\"><eb:Reference xlink:href=\"cid:Content1@e-mis.com/EMISWeb/GP2GP2.2A\" xmlns:xlink=\"http://www.w3.org/1999/xlink\"><eb:Description xml:lang=\"en\">COPC_IN000001UK01</eb:Description><hl7ebxml:Payload style=\"HL7\" encoding=\"XML\" version=\"3.0\" /></eb:Reference><eb:Reference xlink:href=\"cid:Attachment1@e-mis.com/EMISWeb/GP2GP2.2A\" eb:id=\"_A184602B-BA19-47C9-82BA-67B0CAFFEF03\" xmlns:xlink=\"http://www.w3.org/1999/xlink\"><eb:Description xml:lang=\"en\">Filename=\"4AB6EDEE-958F-4828-BDA5-B49285A83B3E_sample_0.bin\" ContentType=application/octet-stream Compressed=No LargeAttachment=No OriginalBase64=No Length=4718592</eb:Description></eb:Reference><eb:Reference xlink:href=\"mid:38E6D508-888B-4B84-8D33-34C8C0D4B1C3\" eb:id=\"_338CA4A2-32DB-4C84-B85B-F03452F02826\" xmlns:xlink=\"http://www.w3.org/1999/xlink\"><eb:Description xml:lang=\"en\">Filename=\"4AB6EDEE-958F-4828-BDA5-B49285A83B3E_sample_1.bin\" ContentType=application/octet-stream Compressed=No LargeAttachment=No OriginalBase64=No Length=3670016</eb:Description></eb:Reference></eb:Manifest></soap:Body></soap:Envelope>", "payload": "<COPC_IN000001UK01 xmlns:xsi=\"http://www.w3.org/2001/XMLSchema-instance\" xmlns:xs=\"http://www.w3.org/2001/XMLSchema\" xmlns=\"urn:hl7-org:v3\"><id root=\"6DB0BD79-3760-47BC-9D15-0D34D61FD90B\" /><creationTime value=\"20210408092827\" /><versionCode code=\"3NPfIT7.2.02\" /><interactionId root=\"2.16.840.1.113883.2.1.3.2.4.12\" extension=\"COPC_IN000001UK01\" /><processingCode code=\"P\" /><processingModeCode code=\"T\" /><acceptAckCode code=\"NE\" /><communicationFunctionRcv type=\"CommunicationFunction\" typeCode=\"RCV\"><device type=\"Device\" classCode=\"DEV\" determinerCode=\"INSTANCE\"><id root=\"1.2.826.0.1285.0.2.0.107\" extension=\"200000001161\" /></device></communicationFunctionRcv><communicationFunctionSnd type=\"CommunicationFunction\" typeCode=\"SND\"><device type=\"Device\" classCode=\"DEV\" determinerCode=\"INSTANCE\"><id root=\"1.2.826.0.1285.0.2.0.107\" extension=\"200000000631\" /></device></communicationFunctionSnd><ControlActEvent classCode=\"OBS\" moodCode=\"EVN\"><author1 type=\"Participation\" typeCode=\"AUT\"><AgentSystemSDS type=\"RoleHeir\" classCode=\"AGNT\"><agentSystemSDS type=\"Device\" classCode=\"DEV\" determinerCode=\"INSTANCE\"><id root=\"1.2.826.0.1285.0.2.0.107\" extension=\"200000001161\" /></agentSystemSDS></AgentSystemSDS></author1><subject typeCode=\"SUBJ\" contextConductionInd=\"false\"><PayloadInformation classCode=\"OBS\" moodCode=\"EVN\"><code code=\"GP2GPLMATTACHMENTINFO\" codeSystem=\"2.16.840.1.113883.2.1.3.2.4.17.202\" displayName=\"GP2GP Large Message Attachment Information\" /><id root=\"6DB0BD79-3760-47BC-9D15-0D34D61FD90B\" /><messageType root=\"2.16.840.1.113883.2.1.3.2.4.18.17\" extension=\"RCMR_MT000001GB01\" xmlns=\"NPFIT:HL7:Localisation\" /><value><Gp2gpfragment xmlns:xsd=\"http://www.w3.org/2001/XMLSchema\" xmlns:xsi=\"http://www.w3.org/2001/XMLSchema-instance\" xmlns=\"urn:nhs:names:services:gp2gp\"><Version xsi:type=\"xsd:string\">01</Version><Recipients><Recipient>A91368</Recipient></Recipients><From>A91720</From><subject>Attachment: 4AB6EDEE-958F-4828-BDA5-B49285A83B3E_sample_0.bin</subject><message-id>${messageId}</message-id></Gp2gpfragment></value><pertinentInformation typeCode=\"PERT\"><sequenceNumber value=\"1\" /><pertinentPayloadBody classCode=\"OBS\" moodCode=\"EVN\"><code code=\"GP2GPLMATTACHMENT\" codeSystem=\"2.16.840.1.113883.2.1.3.2.4.17.202\" displayName=\"GP2GP Large Message Attachment\" /><id root=\"6DB0BD79-3760-47BC-9D15-0D34D61FD90B\" /><value><reference value=\"file://localhost/4AB6EDEE-958F-4828-BDA5-B49285A83B3E_sample_0.bin\" /></value></pertinentPayloadBody></pertinentInformation></PayloadInformation></subject></ControlActEvent></COPC_IN000001UK01>", "attachments": [{"payload": "+z09NTIdEZS3IM0aQpo5ung0+UsHg83MfSKGsSNYMZ735JqX4XZiIM5yrwDqMTfyN0ht2zPZBndwcLcQll9xXu4uI17", "is_base64": true, "content_id": "Attachment1@e-mis.com/EMISWeb/GP2GP2.2A", "content_type": "application/octet-stream"}]}